#+ORG2BLOG:
#+BLOG: wisdomandwonder
#+POSTID: 10665
#+DATE: [2017-08-15 Tue 18:16]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+CATEGORY: Article
#+TAGS: Programming Language, Go Lang, GBEN
#+TITLE: (Go Lang) If/Else (GBEN)

[[https://gobyexample.com/if-else][Go by Example]]
* Example
- Just like in ~C~
  - But with let-like bindings in declaration
    - So last line would generate an error because num is out of scope
- No ternary
#+HTML: <!--more-->
#+NAME: org_gcr_2017-08-15_mara_D4183B65-0FF0-45D7-944F-08B76DC2907C
#+BEGIN_SRC go :imports '("fmt") :results output
// Here’s a basic example.
if 7%2 == 0 {
  fmt.Println("7 is even")
} else {
  fmt.Println("7 is odd")
}
// You can have an if statement without an else.
if 8%4 == 0 {
  fmt.Println("8 is divisible by 4")
}
// A statement can precede conditionals; any variables declared in this
// statement are available in all branches.
if num := 9; num < 0 {
  fmt.Println(num, "is negative")
} else if num < 10 {
  fmt.Println(num, "has 1 digit")
} else {
  fmt.Println(num, "has multiple digits")
}
#+END_SRC

#+RESULTS: org_gcr_2017-08-15_mara_D4183B65-0FF0-45D7-944F-08B76DC2907C
#+BEGIN_EXAMPLE
7 is odd
8 is divisible by 4
9 has 1 digit
#+END_EXAMPLE
